/******************************************************************************/
/*                                                                            */
/* src/booter/include/Intmng.h                                                */
/*                                                                 2021/11/27 */
/* Copyright (C) 2017-2021 Mochi.                                             */
/*                                                                            */
/******************************************************************************/
#ifndef INTMNG_H
#define INTMNG_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdint.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* 割込み番号定義 */
#define INTMNG_INT_NO_MIN    (    0 )                   /**< 割込み番号最小値 */
#define INTMNG_INT_NO_MAX    ( 0x4F )                   /**< 割込み番号最大値 */
#define INTMNG_INT_NO_NUM    ( INTMNG_INT_NO_MAX + 1 )  /**< 割込み番号数     */

/** PICベクタ番号ベース */
#define INTMNG_PIC_VCTR_BASE ( 0x20 )

/** 割込みハンドラ関数型 */
typedef void ( *IntmngHdl_t )( uint32_t intNo );


/******************************************************************************/
/* グローバル関数プロトタイプ宣言                                             */
/******************************************************************************/
/*----------*/
/* Intmng.c */
/*----------*/
/* 割込み管理初期化 */
extern void IntmngInit( void );

/*-------------*/
/* IntmngHdl.c */
/*-------------*/
/* 割込みハンドラ設定 */
extern void IntmngHdlSet( uint32_t    intNo,
                          IntmngHdl_t func   );

/*-------------*/
/* IntmngPic.c */
/*-------------*/
/* PIC割込み許可 */
extern void IntmngPicAllowIrq( uint8_t irqNo );

/* PIC割込み拒否 */
extern void IntmngPicDenyIrq( uint8_t irqNo );

/* PIC割込み無効化 */
extern void IntmngPicDisable( void );

/* PIC割込み有効化 */
extern void IntmngPicEnable( void );

/* PIC割込みEOI通知 */
extern void IntmngPicEoi( uint8_t irqNo );


/******************************************************************************/
#endif
