/******************************************************************************/
/* src/kernel/TaskMng/TaskMngProc.h                                           */
/*                                                                 2018/05/11 */
/* Copyright (C) 2018 Mochi.                                                  */
/******************************************************************************/
#ifndef TASKMNG_PROC_H
#define TASKMNG_PROC_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 共通ヘッダ */
#include <stdint.h>
#include <kernel/types.h>


/******************************************************************************/
/* グローバル関数プロトタイプ宣言                                             */
/******************************************************************************/
/* ページディレクトリID取得 */
extern uint32_t TaskMngProcGetPageDirId( MkPid_t pid );

/* プロセスタイプ取得 */
extern uint8_t TaskMngProcGetType( MkPid_t pid );

/* プロセス管理初期化 */
extern void TaskMngProcInit( void );


/******************************************************************************/
#endif
