/******************************************************************************/
/*                                                                            */
/* src/kernel/Taskmng/TaskmngProc.h                                           */
/*                                                                 2021/05/29 */
/* Copyright (C) 2018-2021 Mochi.                                             */
/*                                                                            */
/******************************************************************************/
#ifndef TASKMNG_PROC_H
#define TASKMNG_PROC_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdint.h>

/* ライブラリヘッダ */
#include <MLib/MLibDynamicArray.h>

/* 共通ヘッダ */
#include <hardware/IA32/IA32Instruction.h>
#include <kernel/types.h>

/* モジュールヘッダ */
#include <Memmng.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/** プロセス管理情報 */
typedef struct {
    MkPid_t            pid;             /**< プロセスID                       */
    uint8_t            type;            /**< プロセスタイプ                   */
    MemmngPageDirId_t  dirId;           /**< ページディレクトリID             */
    IA32PagingPDBR_t   pdbr;            /**< ページディレクトリベースレジスタ */
    void               *pEntryPoint;    /**< エントリポイント                 */
    void               *pEndPoint;      /**< エンドポイント                   */
    void               *pBreakPoint;    /**< ブレイクポイント                 */
    MLibDynamicArray_t threadTbl;       /**< スレッド管理情報動的配列         */
} ProcInfo_t;


/******************************************************************************/
/* モジュール内グローバル関数宣言                                             */
/******************************************************************************/
/* プロセス管理情報取得 */
extern ProcInfo_t *ProcGetInfo( MkPid_t pid );
/* プロセス制御初期化 */
extern void ProcInit( void );


/******************************************************************************/
#endif
