/******************************************************************************/
/* src/kernel/TimerMng/TimerMngPit.c                                          */
/*                                                                 2016/12/16 */
/* Copyright (C) 2016 Mochi.                                                  */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 共通ヘッダ */
#include <stdint.h>
#include <hardware/I8254/I8254.h>
#include <hardware/I8259A/I8259A.h>
#include <hardware/IA32/IA32Instruction.h>

/* 外部モジュールヘッダ */
#include <IntMng.h>
#include <TimerMng.h>

/* 内部モジュールヘッダ */


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/** PIT（カウンタ0）カウンタ設定値 */
#define PIT_CYCLE ( 11932 )


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       PIT割込みハンドラ
 * @details     PITからの割込み処理を行う。
 * 
 * @param[in]   intNo 割込み番号
 */
/******************************************************************************/
void TimerMngPitHdlInt( uint32_t intNo )
{
    /* 割込み処理終了通知 */
    IntMngPicEoi( I8259A_IRQ0 );
    
    return;
}


/******************************************************************************/
/**
 * @brief       PIT管理初期化
 * @details     PIT管理サブモジュールの初期化を行う。
 */
/******************************************************************************/
void TimerMngPitInit( void )
{
    /* PIT（カウンタ0）初期化 */
    IA32InstructionOutByte( I8254_PORT_CTRLW,
                            ( I8254_CTRLW_SC_CNTR0 |
                              I8254_CTRLW_RW_BOTH  |
                              I8254_CTRLW_M_MODE2  |
                              I8254_CTRLW_BCD_BIN    ) );
    IA32InstructionOutByte( I8254_PORT_CNTR0, I8254_CNTR_LOW(  PIT_CYCLE ) );
    IA32InstructionOutByte( I8254_PORT_CNTR0, I8254_CNTR_HIGH( PIT_CYCLE ) );
    
    /* 割込みハンドラ設定 */
    IntMngHdlSet( INTMNG_PIC_VCTR_BASE + I8259A_IRQ0, TimerMngPitHdlInt );
    
    /* 割込み許可設定 */
    IntMngPicAllowIrq( I8259A_IRQ0 );
    
    return;
}


/******************************************************************************/
