/******************************************************************************/
/*                                                                            */
/* kernel/timer.h                                                             */
/*                                                                 2019/04/04 */
/* Copyright (C) 2018-2019 Mochi.                                             */
/*                                                                            */
/******************************************************************************/
#ifndef _MK_TIMER_H_
#define _MK_TIMER_H_
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stddef.h>
#include <stdint.h>

/* カーネルヘッダ */
#include "config.h"
#include "types.h"


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* 機能ID */
#define MK_TIMER_FUNCID_SLEEP     ( 0x00000001 )    /**< スリープ */

/* エラー番号 */
#define MK_TIMER_ERR_NONE         ( 0x00000000 )    /**< エラー無し   */
#define MK_TIMER_ERR_PARAM_FUNCID ( 0x00000001 )    /**< 機能ID不正   */
#define MK_TIMER_ERR_NO_RESOURCE  ( 0x00000002 )    /**< リソース不足 */

/* 戻り値 */
#define MK_TIMER_RET_FAILURE      ( -1 )            /**< 失敗 */
#define MK_TIMER_RET_SUCCESS      (  0 )            /**< 成功 */

/** タイマパラメータ */
typedef struct {
    uint32_t funcId;    /**< 機能ID         */
    uint32_t errNo;     /**< エラー番号     */
    int32_t  ret;       /**< 戻り値         */
    uint32_t usec;      /**< タイマ値(μ秒) */
} MkTimerParam_t;


/******************************************************************************/
#endif
