/******************************************************************************/
/* src/kernel/include/TaskMng.h                                               */
/*                                                                 2018/05/01 */
/* Copyright (C) 2018 Mochi.                                                  */
/******************************************************************************/
#ifndef TASKMNG_H
#define TASKMNG_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 共通ヘッダ */
#include <stddef.h>
#include <stdint.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* タスクID */
#define TASKMNG_TASK_ID_MIN  ( 0 )                      /** タスクID最小値 */
#define TASKMNG_TASK_ID_MAX  ( 4096 )                   /** タスクID最大値 */
#define TASKMNG_TASK_ID_NULL ( TASKMNG_TASK_ID_MAX + 1 )/** タスクID無     */
#define TASKMNG_TASK_ID_NUM  ( TASKMNG_TASK_ID_MAX + 1 )/** タスクID数     */
#define TASKMNG_TASK_ID_IDLE ( 0 )                      /** アイドルタスク */

/* タスクタイプ */
#define TASKMNG_TASK_TYPE_DRIVER ( 0 )  /** ドライバ */
#define TASKMNG_TASK_TYPE_SERVER ( 1 )  /** サーバ   */
#define TASKMNG_TASK_TYPE_USER   ( 2 )  /** ユーザ   */


/******************************************************************************/
/* グローバル関数プロトタイプ宣言                                             */
/******************************************************************************/
/*---------------*/
/* TaskMngInit.c */
/*---------------*/
/* タスク管理初期化 */
extern void TaskMngInit( void );

/*--------------*/
/* TaskMngSched */
/*--------------*/
/* スケジューラ実行 */
extern void TaskMngSchedExec( void );

/* タスク追加 */
extern uint32_t TaskMngTaskAdd( uint8_t taskType,
                                void    *pAddr,
                                size_t  size      );


/******************************************************************************/
#endif
