/******************************************************************************/
/*                                                                            */
/* src/kernel/Memmng/Memmng.c                                                 */
/*                                                                 2024/06/02 */
/* Copyright (C) 2016-2024 Mochi.                                             */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdarg.h>

/* 外部モジュールヘッダ */
#include <Cmn.h>
#include <Debug.h>

/* 内部モジュールヘッダ */
#include "MemmngArea.h"
#include "MemmngSgmt.h"
#include "MemmngHeap.h"
#include "MemmngIo.h"
#include "MemmngMap.h"
#include "MemmngPage.h"
#include "MemmngPhys.h"
#include "MemmngVirt.h"


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* モジュールID */
#define _MODULE_ID_ CMN_MODULE_MEMMNG_MAIN


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       メモリ管理初期化
 * @details     各サブモジュールの初期化を行う。
 *
 * @param[in]   *pBiosE820  BIOS-E820メモリマップ
 * @param[in]   biosE820Num BIOS-E820メモリマップエントリ数
 * @param[in]   *pMemMap    メモリマップ
 * @param[in]   memMapNum   メモリマップエントリ数
 */
/******************************************************************************/
void MemmngInit( BiosE820Entry_t *pBiosE820,
                 size_t          biosE820Num,
                 MkMemMapEntry_t *pMemMap,
                 size_t          memMapNum    )
{
    DEBUG_LOG_TRC( "%s() start.", __func__ );

    /* メモリマップ管理サブモジュール初期化 */
    MapInit( pBiosE820, biosE820Num, pMemMap, memMapNum );

    /* セグメンテーション管理サブモジュール初期化 */
    MemmngSgmtInit();

    /* ヒープ管理サブモジュール初期化 */
    HeapInit();

    /* 物理メモリ領域管理サブモジュール初期化 */
    PhysInit( pMemMap, memMapNum );

    /* ページ管理サブモジュール初期化 */
    PageInit();

    /* I/Oメモリ領域管理サブモジュール初期化 */
    IoInit( pMemMap, memMapNum );

    /* 仮想メモリ領域管理サブモジュール初期化 */
    VirtInit();

    DEBUG_LOG_TRC( "%s() end.", __func__ );

    return;
}


/******************************************************************************/
